# CreateMultiple Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PathOfTravel..::..CreateMultiple Method
PathOfTravel Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateMultiple(View, IList<(Of <<'(XYZ>)>>), IList<(Of <<'(XYZ>)>>)) | Creates multiple new paths of travel between same size sets of start and end points. |
| CreateMultiple(View, IList<(Of <<'(XYZ>)>>), IList<(Of <<'(XYZ>)>>), IList<(Of <<'(PathOfTravelCalculationStatus>)>>)%) | Creates multiple new paths of travel between same size sets of start and end points and provides creation result statuses. |

# See Also
PathOfTravel Class
PathOfTravel Members
Autodesk.Revit.DB.Analysis Namespace